[
  {
    "dates": "March 2014 - Today",
    "employer_name": "Akron Business Technologies Srl - Via Guantai Nuovi 11, 80133, Napoli, Italy",
    "activity_field": "Marketing services, web developing",
    "job_type": "Web developer",
    "main_subjects": "PHP and MySQL databases development for Archet Srl, an Akron Business Technologies's client."
  },
  {
    "dates": "November 2012",
    "employer_name": "The Kennard Hotel - 11 Henrietta St, Bath, Avon BA2 6LL, United Kingdom",
    "activity_field": "Hotel & Catering services",
    "job_type": "Security Specialist",
    "main_subjects": "Application Penetration Test with SQL-injection, path traversal, source code or database exposure, denial of service and authorization bypass tests; in-depth analysis with Microsoft ASP.NET decompilers."
  },
  {
    "dates": "March 2014 - Today",
    "employer_name": "Akron Business Technologies Srl - Via Guantai Nuovi 11, 80133, Napoli, Italy",
    "activity_field": "Marketing services, web developing",
    "job_type": "Web developer",
    "main_subjects": "PHP and MySQL databases development for Archet Srl, an Akron Business Technologies's client."
  },
  {
    "dates": "November 2012",
    "employer_name": "The Kennard Hotel - 11 Henrietta St, Bath, Avon BA2 6LL, United Kingdom",
    "activity_field": "Hotel & Catering services",
    "job_type": "Security Specialist",
    "main_subjects": "Infrastructure penetration test towards the whole cable and WiFi networks."
  },
  {
    "dates": "February - May 2012",
    "employer_name": "Serverplan srl - Via G. Leopardi 22, 03043, Cassino, Frosinone, Italy",
    "activity_field": "Hosting, dedicated servers, VPS, domain names and advanced web services",
    "job_type": "Linux and Windows System engineer",
    "main_subjects": "Linux and Windows server administration, intrusion detection, PHP and MySQL optimization, helpdesk support."
  },
  {
    "dates": "2005 - December 2011",
    "employer_name": "Akron Business Technologies Srl - Via Guantai Nuovi 11, 80133, Napoli, Italy",
    "activity_field": "Marketing services, web developing",
    "job_type": "Senior system integrator, security specialist, senior web and client-side developer, senior system engineer",
    "main_subjects": "PHP and MySQL databases developing, system and network administration of many development and production machines Linux CentOS and Debian based (virtualized with either VMWare and XenServer), development of a Windows interface to a cryptographic demo box (subject to a non-disclosure agreement; no further details available), demos involving both a cryptographic box and its algorithm (subject to a non-disclosure agreement; no further details available), deployment of an Asterisk enviroinment for call center, system integration between Asterisk PBX and vTiger CRM, backup system deployment (based on Bacula, then Rsync has been deployed too to allow a geographical mirroring), mail system deployment (based on Postfix, Dovecot, Roundcube, Procmail, DSpam and several custom made python filters), penetration and risk management tests, development of a Linux live distro for remote call center, deployment of an OpenVPN network for remote call center operators and remote server management, videoconferencing (through 2 ip cameras), network domain configuration based on Windows 2003 Server with Active Directory."
  },
  {
    "dates": "November 2009 - May 2010",
    "employer_name": "Az Investigazioni Srl - Via Santa Lucia 50, 80100, Napoli, Italy",
    "activity_field": "Intelligence, computer forensics and security, countersurveillance, personal investigations",
    "job_type": "Senior web and application developer, senior forensic and security consultant",
    "main_subjects": "Development of a remote surveillance software using Python and MySQL (subject to a non-disclosure agreement; no further details available), penetration and risk management tests."
  },
  {
    "dates": "April 2009 - May 2009",
    "employer_name": "Stoà S.c.p.A. - Villa Campolieto, Corso Resìna 283, Ercolano, Napoli, Italy",
    "activity_field": "Higher education",
    "job_type": "Teacher",
    "main_subjects": "Teacher for base users: taught 'Comune di Napoli' personnel about using OpenOffice and GNU/Linux.<br />Teacher for system engineering: taught 'Comune di Napoli' personnel about Linux on the system engineering side, with the configuration of several GNU/Linux daemons."
  }
]